{"format": "graph-model", "generatedBy": "2.4.0", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"inputs": {"lstm_1_input:0": {"name": "lstm_1_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "50"}, {"size": "7"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/Read/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "120"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "30"}, {"size": "120"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/Read_2/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "120"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "30"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "lstm_1_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "50"}, {"size": "7"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_29", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/Read/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_30", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/Read_1/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_31", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/Read_2/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_23", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/time"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_21", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_counter"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/Shape", "op": "Shape", "input": ["lstm_1_input"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/transpose", "op": "Transpose", "input": ["lstm_1_input", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_40", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_29", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_76"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_41", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_30", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_77"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_42", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_31", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_78"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_34", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_23", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_70"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_32", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_21", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_68"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/Shape", "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack", "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack_1", "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/transpose", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/strided_slice", "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/packed/1"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/strided_slice", "StatefulPartitionedCall/sequential_1/lstm_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_28", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/Shape", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/packed", "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/zeros/packed", "StatefulPartitionedCall/sequential_1/lstm_1/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_39", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_28", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_75"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_27", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_26", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/zeros_1"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_25", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/zeros"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_24", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayV2_1"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_38", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_27", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_74"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_37", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_26", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_73"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_36", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_25", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_72"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_35", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/enter/_24", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_71"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/cond/_19/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_34", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_38", "^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_32"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/LoopCond/_43", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/cond/_19/while/Less"]}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/input/_10_switch/_49", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_37", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/LoopCond/_43"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_51", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_39", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/LoopCond/_43"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/input/_11_switch/_52", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_40", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/LoopCond/_43"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/input/_9_switch/_48", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_36", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/LoopCond/_43"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/input/_12_switch/_53", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_41", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/LoopCond/_43"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/input/_13_switch/_54", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_42", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/LoopCond/_43"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/time_switch/_46", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_34", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/LoopCond/_43"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_counter_switch/_44", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_32", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/LoopCond/_43"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayV2_1_switch/_47", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_35", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/LoopCond/_43"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice_switch/_50", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/merge/_38", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/LoopCond/_43"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_55", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_counter_switch/_44:1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/exit/_59", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayV2_1_switch/_47"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/split/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_55"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_75", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_51:1", "^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_55"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_55"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_76", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/input/_11_switch/_52:1", "^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_55"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_77", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/input/_12_switch/_53:1", "^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_55"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/input/_9_switch/_48:1", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/input/_12_switch/_53:1", "^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_55"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_78", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/input/_13_switch/_54:1", "^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_55"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/input/_95", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/time_switch/_46:1", "^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_55"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/add_2/y", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_55"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/add_3/y", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_55"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_74", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice_switch/_50:1", "^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_55"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/exit/_59", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_51:1", "Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/input/_95", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/add_2", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/input/_95", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/add_2/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_counter_switch/_44:1", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/add_3/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice_2/stack", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice_2/stack_1", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice_2/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/input/_11_switch/_52:1"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_70", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/add_2", "^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_55"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_68", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/add_3", "^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_55"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice_2", "StatefulPartitionedCall/sequential_1/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/MatMul", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/add", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/input/_13_switch/_54:1"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/split", "op": "Split", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/split/split_dim", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "4"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/Sigmoid_1", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/input/_10_switch/_49:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/Sigmoid", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/mul", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/Tanh_1", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_73", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/add_1", "^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_55"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/Sigmoid_2", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/Tanh_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_72", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/mul_2", "^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_55"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayV2_1_switch/_47:1", "Func/StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/input/_95", "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/mul_2"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/next_iteration/_71", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/TensorArrayV2Write/TensorListSetItem", "^StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_body_control/_55"], "attr": {"T": {"type": "DT_VARIANT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayV2_1/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/Read/ReadVariableOp", "shape": [7, 120], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/Read_1/ReadVariableOp", "shape": [30, 120], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/Read_2/ReadVariableOp", "shape": [120], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/time", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/loop_counter", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice_2/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice_2/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/strided_slice_2/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/MatMul/ReadVariableOp", "shape": [30, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/TensorArrayV2Read/TensorListGetItem/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/add_2/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/PartitionedCall/while/body/_20/while/add_3/y", "shape": [], "dtype": "int32"}]}]}